#Вводится список целых чисел в одну строчку через пробел. Необходимо оставить в нем только двузначные числа.
#Реализовать программу с использованием функции filter. Результат отобразить на экране в виде последовательности
#оставшихся чисел в одну строчку через пробел.[1,2,3,4,22,234,24] ----> [22, 24]
#Все задачи решать с помощью использования лямбд, filter, map, zip, enumerate, List Comprehension

lst = list(map(int, input('Введите список целых чисел в одну строчку через пробел:').split()))
lst = list(filter(lambda x: True if (abs(x) >= 10 and abs(x) <= 99) else False, lst))
print(*lst)